## Cache 적용
### 1️⃣ 매진 랭킹 목록 조회
#### 기능 및 요구사항
- 메인 화면이나 콘서트 랭킹 조회 화면에서 제공하는 매진 랭킹 목록 조회 기능
- 사용자의 접근 빈도가 높지만 업데이트는 상대적으로 적게 발생 → 실시간성에 민감하지 않음
- 조회 성능 향상 + DB 부하 감소 목적으로 캐시 도입

#### 캐시 전략
- `@Cacheable` 방식 사용
  - 클라이언트 요청 시 캐시를 먼저 조회
  - 캐시에 데이터가 없으면 DB 조회 후 캐시에 저장
- 캐시 무효화 전략
  - 매진된 콘서트가 신규 추가 되었을 경우
  - 현재 흐름이 [사용자 좌석 결제 완료] → [남은 좌석 수 0개로 매진] → [랭킹 계산] 이므로 랭킹 캐시 갱신이 필요
  - 매진 발생 시, `@CacheEvict` 로 전체 캐시를 제거한 후 캐시 갱신

- TTL 설정
  - 캐시가 무한히 유지되지 않도록 TTL 설정 (기본 10분)

#### 캐시 대상 Redis 구조 설계
- 랭킹 순서 관리 → Sorted Set
```
Key : ranking:weekly:soldout
Score : 계산한 점수
TTL : 10분 (= 600000ms)
```





