# 동시성 문제 설계 및 해결 보고서
## 1️⃣ 대기열 진입 시 최대 활성 토큰 초과 발생 가능
### 문제 상황 및 내부 구조
- 콘서트 날짜 조회 후 동시에 여러 명이 활성 대기열 토큰 발급 요청 시 최대 활성자 수를 초과할 수 있다.
- 사용자 식별자로 기존 토큰을 확인하고, 없거나 만료된 경우 분산 락을 획득한다.
- 현재 활성 사용자 수를 기준으로 활성 토큰 또는 대기 토큰을 생성하고 Redis에 저장한다.
- 예외 발생 시 Redis 정리 후 롤백하고, 마지막에 락을 해제한다.
### 해결 전략
- **Lock 방식 : Redis 기반 분산 락**
- 멀티 서버 환경에서 여러 사용자가 토큰을 발급받을 수 있어 데이터 정합성 문제가 발생할 수 있음
- 임계 구간 보호를 위해 도입
- 락 점유 시간 최소화를 위해 타임아웃 10초로 설정
- 락 점유 실패 시 사용자에게 재시도 안내하여 데드락 방지
### 테스트 결과
- 시나리오
  - 동시에 여러명이 대기열 토큰 발급 요청 시 최대 활성자 수를 넘지 않는다.
- 결과










